package project

/*
	История
	открываем страницу с настройкой связи между спутником и земной станцией
	делаем запрос в базу на предмет наличия текущего активного проекта

	если проект не найден - предлагаем создать
	если проект найден, но активных не назначено - предлагаем назначить
	если проект найден и есть активный - говорим софту, как его звать

	далее для активного проекта ищем земные станции - найдена одна - отображаем ее
	если не найдена - предлагаем создать - отображаем
	если найдно несколько - предлагаем выбор - отображаем

	после отображаения станции ищем связаный спутник
	если спутник найден - отображаем спутник
	если не найден - предлагаем создать - связываем и отображаем

	далее настраиваем отдельные компоненты
*/
import "net/http"

const CollectionName = "projects"

func ProjectsGet() http.HandlerFunc {
	return func(w http.ResponseWriter, r *http.Request) {

	}
}
